Дошкольное_учреждение83/src/Documents/удуВозвратМетодическихМатериалов/удуВозвратМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуВозвратМетодическихМатериалов</name>
  <registerRecords>AccumulationRegister.удуМетодическиеМатериалыНаРуках</registerRecords>
  <attributes>
    <name>Читатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоПричине</name>
    <type>
      <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетЕдКВозврату</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Потеряно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозврата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вернуть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаРуках</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКСдаче</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоПричине</name>
      <type>
        <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/AccumulationRegisters/удуМетодическиеМатериалыНаРуках/удуМетодическиеМатериалыНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуМетодическиеМатериалыНаРуках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЕдиница</name>
    <type>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Читатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыдачи</name>
    <type>
      <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/Documents/удуВозвратМетодическихМатериалов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуМетодическиеМатериалыНаРуках.Записывать = Истина;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	удуВозвратМетодическихМатериалов.Читатель КАК Читатель,
	|	удуВозвратМетодическихМатериаловУчетЕдКВозврату.КоличествоКСдаче КАК Количество,
	|	удуВозвратМетодическихМатериаловУчетЕдКВозврату.ДатаВозврата КАК ПлановаяДатаВозврата,
	|	удуВозвратМетодическихМатериаловУчетЕдКВозврату.УчетнаяЕдиница,
	|	удуВозвратМетодическихМатериаловУчетЕдКВозврату.ИнвентарныйНомер,
	|	удуВозвратМетодическихМатериаловУчетЕдКВозврату.ПоПричине КАК ПричинаВыдачи,
	|	удуВозвратМетодическихМатериалов.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	удуВозвратМетодическихМатериаловУчетЕдКВозврату.НомерСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.удуВозвратМетодическихМатериалов.УчетЕдКВозврату КАК удуВозвратМетодическихМатериаловУчетЕдКВозврату
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.удуВозвратМетодическихМатериалов КАК удуВозвратМетодическихМатериалов
	|		ПО удуВозвратМетодическихМатериаловУчетЕдКВозврату.Ссылка = удуВозвратМетодическихМатериалов.Ссылка
	|ГДЕ
	|	удуВозвратМетодическихМатериалов.Ссылка = &Ссылка
	|	И удуВозвратМетодическихМатериаловУчетЕдКВозврату.КоличествоКСдаче > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Читатель,
	|	ВТ.Количество,
	|	ВТ.ПлановаяДатаВозврата,
	|	ВТ.УчетнаяЕдиница,
	|	ВТ.ИнвентарныйНомер,
	|	ВТ.ПричинаВыдачи,
	|	ВТ.Период,
	|	ВТ.ВидДвижения
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Движения.удуМетодическиеМатериалыНаРуках.Загрузить(Результат.Выгрузить());
	Движения.удуМетодическиеМатериалыНаРуках.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ.УчетнаяЕдиница,
	               |	ВТ.ИнвентарныйНомер,
	               |	ВТ.Читатель,
	               |	ВТ.ПлановаяДатаВозврата,
	               |	ВЫБОР
	               |		КОГДА ВТ.ПричинаВыдачи = ЗНАЧЕНИЕ(Справочник.удуПричиныВыдачиМетодическихМатериалов.ПустаяСсылка)
	               |			ТОГДА ""<НетПричины>""
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ВТ.ПричинаВыдачи)
	               |	КОНЕЦ КАК ПричинаВыдачи,
	               |	-ЕСТЬNULL(удуМетодическиеМатериалыНаРукахОстатки.КоличествоОстаток, 0) КАК Излишек,
	               |	ВТ.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.удуМетодическиеМатериалыНаРуках.Остатки(
	               |				&Период,
	               |				(Читатель, УчетнаяЕдиница, ПричинаВыдачи, ИнвентарныйНомер, ПлановаяДатаВозврата) В
	               |					(ВЫБРАТЬ
	               |						ВТ.Читатель,
	               |						ВТ.УчетнаяЕдиница,
	               |						ВТ.ПричинаВыдачи,
	               |						ВТ.ИнвентарныйНомер,
	               |						ВТ.ПлановаяДатаВозврата
	               |					ИЗ
	               |						ВТ КАК ВТ)) КАК удуМетодическиеМатериалыНаРукахОстатки
	               |		ПО ВТ.Читатель = удуМетодическиеМатериалыНаРукахОстатки.Читатель
	               |			И ВТ.УчетнаяЕдиница = удуМетодическиеМатериалыНаРукахОстатки.УчетнаяЕдиница
	               |			И ВТ.ИнвентарныйНомер = удуМетодическиеМатериалыНаРукахОстатки.ИнвентарныйНомер
	               |			И ВТ.ПлановаяДатаВозврата = удуМетодическиеМатериалыНаРукахОстатки.ПлановаяДатаВозврата
	               |			И ВТ.ПричинаВыдачи = удуМетодическиеМатериалыНаРукахОстатки.ПричинаВыдачи
	               |ГДЕ
	               |	удуМетодическиеМатериалыНаРукахОстатки.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("Период",
	?(Режим = РежимПроведенияДокумента.Оперативный, Неопределено, Новый Граница(МоментВремени(),ВидГраницы.Включая)));
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Выборка = результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение.Текст = "В строке " + Выборка.НомерСтроки + " указано больше литературы, чем выдавалось 
			|по причине " + Выборка.ПричинаВыдачи + ", на "
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Выборка.Излишек,"единицу,единицы,единиц");
			
			Сообщение.Поле = "УчетЕдКВозврату[" + (Выборка.НомерСтроки-1) + "].УчетнаяЕдиница";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;	
	
	

КонецПроцедуры
